In [221]:
import numpy as np
import pandas as pd

# Series

In [222]:
dict1 = {"Metehan" : 22 , "Emre" : 21 , "Hasan" : 24}
pd.Series(dict1)

Metehan    22
Emre       21
Hasan      24
dtype: int64

In [223]:
age = [22,21,24]
name = ["Metehan" , "Emre" , "Hasan"]
pd.Series(data = age, index = name)

Metehan    22
Emre       21
Hasan      24
dtype: int64

In [224]:
pd.Series(["Metehan", "Emre", "Hasan"] , [1,2,3]) # looking the dtype

1    Metehan
2       Emre
3      Hasan
dtype: object

In [225]:
race1 = pd.Series([100,99,98],["Metehan" , "Emre" , "Hasan"])
race1

Metehan    100
Emre        99
Hasan       98
dtype: int64

In [226]:
race2= pd.Series([65,59,38],["Metehan" , "Emre" , "Hasan"])
race2

Metehan    65
Emre       59
Hasan      38
dtype: int64

In [227]:
racedone = race1 + race2 
racedone

Metehan    165
Emre       158
Hasan      136
dtype: int64

In [228]:
race3= pd.Series([65,59],["Metehan" , "Emre"])
race3

Metehan    65
Emre       59
dtype: int64

In [229]:
race2= pd.Series([65,59,38],["Metehan" , "Emre" , "Hasan"])
race2

Metehan    65
Emre       59
Hasan      38
dtype: int64

In [230]:
race2 + race3 # NAN is not dif.

Emre       118.0
Hasan        NaN
Metehan    130.0
dtype: float64

# DataFrame

In [231]:
data = np.random.randn(4,3)
data

array([[ 1.21606545, -0.97322225, -0.05761733],
       [-0.97810451,  0.59558354, -0.70891678],
       [ 0.13464565, -0.8866835 , -0.10849951],
       [-0.5026525 ,  0.65482824,  0.400405  ]])

In [232]:
dataframe = pd.DataFrame(data)
dataframe

          0         1         2
0  1.216065 -0.973222 -0.057617
1 -0.978105  0.595584 -0.708917
2  0.134646 -0.886684 -0.108500
3 -0.502652  0.654828  0.400405

In [233]:
dataframe1 = pd.DataFrame(data,index = ["Metehan" , "Hasan" , "Ali" , "Emine"] , columns = ["Maaş" , "Yaş" , "Çalışma"])
dataframe1

             Maaş       Yaş   Çalışma
Metehan  1.216065 -0.973222 -0.057617
Hasan   -0.978105  0.595584 -0.708917
Ali      0.134646 -0.886684 -0.108500
Emine   -0.502652  0.654828  0.400405

In [234]:
dataframe1["Yaş"]

Metehan   -0.973222
Hasan      0.595584
Ali       -0.886684
Emine      0.654828
Name: Yaş, dtype: float64

In [235]:
# For index 
dataframe1.loc["Metehan"]

Maaş       1.216065
Yaş       -0.973222
Çalışma   -0.057617
Name: Metehan, dtype: float64

In [236]:
# For İndex 
dataframe1.iloc[0]

Maaş       1.216065
Yaş       -0.973222
Çalışma   -0.057617
Name: Metehan, dtype: float64

In [237]:
dataframe1["Emekli Oranı"] = np.random.randn() + dataframe1["Yaş"] *2
dataframe1
# Here we add a column and give values

             Maaş       Yaş   Çalışma  Emekli Oranı
Metehan  1.216065 -0.973222 -0.057617     -3.198806
Hasan   -0.978105  0.595584 -0.708917     -0.061194
Ali      0.134646 -0.886684 -0.108500     -3.025728
Emine   -0.502652  0.654828  0.400405      0.057295

Dell The Column For DataFrame

In [238]:
dataframe1.drop("Emekli Oranı" , axis = 1 , inplace = True)

In [239]:
dataframe1 = dataframe1.drop("Hasan" , axis = 0)

In [240]:
dataframe1.loc["Metehan" , "Yaş"]

-0.973222254982399

In [241]:
print(dataframe1 > 0)
dataframe1

          Maaş    Yaş  Çalışma
Metehan   True  False    False
Ali       True  False    False
Emine    False   True     True

             Maaş       Yaş   Çalışma
Metehan  1.216065 -0.973222 -0.057617
Ali      0.134646 -0.886684 -0.108500
Emine   -0.502652  0.654828  0.400405

In [242]:
dataframe1[dataframe1["Maaş"] < -0.6] 
# Here too we can learn the big ones and the small ones among the columns and indices

Empty DataFrame
Columns: [Maaş, Yaş, Çalışma]
Index: []

# Change The İndex

In [243]:
newindex = ["Mete" , "Emre" , "Şükür"]
dataframe1["Yeni İsimler"] = newindex
dataframe1

             Maaş       Yaş   Çalışma Yeni İsimler
Metehan  1.216065 -0.973222 -0.057617         Mete
Ali      0.134646 -0.886684 -0.108500         Emre
Emine   -0.502652  0.654828  0.400405        Şükür

In [244]:
dataframe1.set_index("Yeni İsimler" , inplace=True)
dataframe1

                  Maaş       Yaş   Çalışma
Yeni İsimler
Mete          1.216065 -0.973222 -0.057617
Emre          0.134646 -0.886684 -0.108500
Şükür        -0.502652  0.654828  0.400405

In [246]:
dataframe1.loc["Mete"]

Maaş       1.216065
Yaş       -0.973222
Çalışma   -0.057617
Name: Mete, dtype: float64